# https://www.youtube.com/watch?v=RlIiVeig3hc&t=13s

In [1]:
import pandas as pd
import numpy as np

# 1. Show versions

In [2]:
pd.__version__

'2.2.1'

In [3]:
pd.show_versions()

INSTALLED VERSIONS
------------------
commit                : bdc79c146c2e32f2cab629be240f01658cfb6cc2
python                : 3.12.2.final.0
python-bits           : 64
OS                    : Windows
OS-release            : 11
Version               : 10.0.22631
machine               : AMD64
processor             : AMD64 Family 25 Model 33 Stepping 2, AuthenticAMD
byteorder             : little
LC_ALL                : en_US.UTF-8
LANG                  : en_US.UTF-8
LOCALE                : English_United States.1252

pandas                : 2.2.1
numpy                 : 1.26.4
pytz                  : 2024.1
dateutil              : 2.9.0.post0
setuptools            : None
pip                   : 23.2.1
Cython                : None
pytest                : None
hypothesis            : None
sphinx                : None
blosc                 : None
feather               : None
xlsxwriter            : None
lxml.etree            : None
html5lib              : None
pymysql               : None
psycopg2              : None
jinja2                : 3.1.3
IPython               : 8.22.2
pandas_datareader     : None
adbc-driver-postgresql: None
adbc-driver-sqlite    : None
bs4                   : 4.12.3
bottleneck            : None
dataframe-api-compat  : None
fastparquet           : None
fsspec                : None
gcsfs                 : None
matplotlib            : 3.8.3
numba                 : None
numexpr               : None
odfpy                 : None
openpyxl              : None
pandas_gbq            : None
pyarrow               : None
pyreadstat            : None
python-calamine       : None
pyxlsb                : None
s3fs                  : None
scipy                 : 1.12.0
sqlalchemy            : None
tables                : None
tabulate              : None
xarray                : None
xlrd                  : None
zstandard             : None
tzdata                : 2024.1
qtpy                  : None
pyqt5                 : None

# 2. Create exmaple dataframe

In [4]:
pd.DataFrame(np.random.rand(4, 8))

,0,1,2,3,4,5,6,7
0,0.974563,0.272858,0.601695,0.545931,0.845903,0.638943,0.002026,0.052138
1,0.530906,0.814128,0.453816,0.577407,0.626406,0.035806,0.411346,0.688469
2,0.805886,0.085375,0.682791,0.202633,0.067622,0.166322,0.025417,0.418074
3,0.123334,0.948137,0.511474,0.499199,0.148247,0.023217,0.664045,0.865911

In [5]:
df = pd.DataFrame(np.random.rand(4, 8), columns=list('abcdefgh'))

# 3. Rename columns

In [6]:
df.add_prefix('x_')
df.add_suffix('_y')

,a_y,b_y,c_y,d_y,e_y,f_y,g_y,h_y
0,0.504311,0.363959,0.021182,0.860545,0.305720,0.448224,0.370287,0.531805
1,0.739508,0.280993,0.019019,0.497970,0.282585,0.835740,0.265423,0.446237
2,0.587127,0.747384,0.570992,0.979876,0.122890,0.180176,0.419657,0.821015
3,0.343832,0.904748,0.307777,0.048590,0.433560,0.261266,0.807571,0.805229

# 4. Reverse row order

In [7]:
drinks_path = r'F:\DataSpell\Pandas_training\from_youtube_video\data\pandas-videos-master\drinks.csv'
drinks = pd.read_csv(drinks_path)
drinks

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,South America
189,Vietnam,111,2,1,2.0,Asia
190,Yemen,6,0,0,0.1,Asia
191,Zambia,32,19,4,2.5,Africa
192,Zimbabwe,64,18,4,4.7,Africa

In [8]:
drinks.loc[::-1]

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
192,Zimbabwe,64,18,4,4.7,Africa
191,Zambia,32,19,4,2.5,Africa
190,Yemen,6,0,0,0.1,Asia
189,Vietnam,111,2,1,2.0,Asia
188,Venezuela,333,100,3,7.7,South America
...,...,...,...,...,...,...
4,Angola,217,57,45,5.9,Africa
3,Andorra,245,138,312,12.4,Europe
2,Algeria,25,0,14,0.7,Africa
1,Albania,89,132,54,4.9,Europe
0,Afghanistan,0,0,0,0.0,Asia

In [9]:
drinks.loc[::-1].reset_index(drop=True)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Zimbabwe,64,18,4,4.7,Africa
1,Zambia,32,19,4,2.5,Africa
2,Yemen,6,0,0,0.1,Asia
3,Vietnam,111,2,1,2.0,Asia
4,Venezuela,333,100,3,7.7,South America
...,...,...,...,...,...,...
188,Angola,217,57,45,5.9,Africa
189,Andorra,245,138,312,12.4,Europe
190,Algeria,25,0,14,0.7,Africa
191,Albania,89,132,54,4.9,Europe
192,Afghanistan,0,0,0,0.0,Asia

# 5. Reverse column order

In [11]:
drinks.loc[:, ::-1].head()

,continent,total_litres_of_pure_alcohol,wine_servings,spirit_servings,beer_servings,country
0,Asia,0.0,0,0,0,Afghanistan
1,Europe,4.9,54,132,89,Albania
2,Africa,0.7,14,0,25,Algeria
3,Europe,12.4,312,138,245,Andorra
4,Africa,5.9,45,57,217,Angola

# 6. Select columns by data type

In [12]:
drinks.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [14]:
drinks.select_dtypes(include='number').head()

   beer_servings  spirit_servings  wine_servings  total_litres_of_pure_alcohol
0              0                0              0                           0.0
1             89              132             54                           4.9
2             25                0             14                           0.7
3            245              138            312                          12.4
4            217               57             45                           5.9

In [16]:
drinks.select_dtypes(include='object').head()

       country continent
0  Afghanistan      Asia
1      Albania    Europe
2      Algeria    Africa
3      Andorra    Europe
4       Angola    Africa

In [18]:
drinks.select_dtypes(include=['number', 'object','category', 'datetime']).head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [20]:
drinks.select_dtypes(exclude='number').head()

       country continent
0  Afghanistan      Asia
1      Albania    Europe
2      Algeria    Africa
3      Andorra    Europe
4       Angola    Africa

# 7. Convert strings to numbers

In [22]:
df = pd.DataFrame({'col_one': ['1.1', '2.2', '3.3'],
                   'col_two': ['4.4', '5.5', '6.6'],
                   'col_three': ['7.7', '8.8', '-']})
df

  col_one col_two col_three
0     1.1     4.4       7.7
1     2.2     5.5       8.8
2     3.3     6.6         -

In [23]:
df.dtypes

col_one      object
col_two      object
col_three    object
dtype: object

In [26]:
df.astype({'col_one': 'float', 'col_two': 'float'}).dtypes

col_one      float64
col_two      float64
col_three     object
dtype: object

In [29]:
pd.to_numeric(df.col_three, errors='coerce').fillna(0)

0    7.7
1    8.8
2    0.0
Name: col_three, dtype: float64

In [31]:
df = df.apply(pd.to_numeric, errors='coerce').fillna(0)
df

   col_one  col_two  col_three
0      1.1      4.4        7.7
1      2.2      5.5        8.8
2      3.3      6.6        0.0

# 8. Reduce DataFrame size

In [33]:
drinks.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     193 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 27.5 KB

In [35]:
cols = ['beer_servings', 'continent']
small_drinks = pd.read_csv(drinks_path, usecols=cols)
small_drinks.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   beer_servings  193 non-null    int64
 1   continent      193 non-null    object
dtypes: int64(1), object(1)
memory usage: 12.2 KB

In [37]:
dtypes = {'continent': 'category'}
small_drinks = pd.read_csv(drinks_path, usecols=cols, dtype=dtypes)
small_drinks.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   beer_servings  193 non-null    int64
 1   continent      193 non-null    category
dtypes: category(1), int64(1)
memory usage: 2.3 KB

# 9. Build a DataFrame from multiple files (row-wise)

In [43]:
stocks1_path = r'F:\DataSpell\Pandas_training\from_youtube_video\data\pandas-videos-master\stocks1.csv'
stocks2_path = r'F:\DataSpell\Pandas_training\from_youtube_video\data\pandas-videos-master\stocks2.csv'
stocks3_path = r'F:\DataSpell\Pandas_training\from_youtube_video\data\pandas-videos-master\stocks3.csv'

In [44]:
pd.read_csv(stocks1_path)

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT

In [45]:
pd.read_csv(stocks2_path)

         Date   Close    Volume Symbol
0  2016-10-04  113.00  29736800   AAPL
1  2016-10-04   57.24  20085900   MSFT
2  2016-10-04   31.35  18460400   CSCO

In [46]:
pd.read_csv(stocks3_path)

         Date   Close    Volume Symbol
0  2016-10-05   57.64  16726400   MSFT
1  2016-10-05   31.59  11808600   CSCO
2  2016-10-05  113.05  21453100   AAPL

In [41]:
from glob import glob

In [47]:
stocks_pattern = r'F:\DataSpell\Pandas_training\from_youtube_video\data\pandas-videos-master\stocks*.csv'
stock_files = sorted(glob(stocks_pattern))
stock_files

['F:\\DataSpell\\Pandas_training\\from_youtube_video\\data\\pandas-videos-master\\stocks.csv',
 'F:\\DataSpell\\Pandas_training\\from_youtube_video\\data\\pandas-videos-master\\stocks1.csv',
 'F:\\DataSpell\\Pandas_training\\from_youtube_video\\data\\pandas-videos-master\\stocks2.csv',
 'F:\\DataSpell\\Pandas_training\\from_youtube_video\\data\\pandas-videos-master\\stocks3.csv']

In [50]:
pd.concat((pd.read_csv(file) for file in stock_files), ignore_index=True)

          Date   Close    Volume Symbol
0   2016-10-03   31.50  14070500   CSCO
1   2016-10-03  112.52  21701800   AAPL
2   2016-10-03   57.42  19189500   MSFT
3   2016-10-04  113.00  29736800   AAPL
4   2016-10-04   57.24  20085900   MSFT
5   2016-10-04   31.35  18460400   CSCO
6   2016-10-05   57.64  16726400   MSFT
7   2016-10-05   31.59  11808600   CSCO
8   2016-10-05  113.05  21453100   AAPL
9   2016-10-03   31.50  14070500   CSCO
10  2016-10-03  112.52  21701800   AAPL
11  2016-10-03   57.42  19189500   MSFT
12  2016-10-04  113.00  29736800   AAPL
13  2016-10-04   57.24  20085900   MSFT
14  2016-10-04   31.35  18460400   CSCO
15  2016-10-05   57.64  16726400   MSFT
16  2016-10-05   31.59  11808600   CSCO
17  2016-10-05  113.05  21453100   AAPL

# 10. Build a DataFrame from multiple files (column-wise)

In [53]:
pd.read_csv(r'F:\DataSpell\Pandas_training\from_youtube_video\data\pandas-videos-master\drinks1.csv')

         country  beer_servings  spirit_servings
0    Afghanistan              0                0
1        Albania             89              132
2        Algeria             25                0
3        Andorra            245              138
4         Angola            217               57
..           ...            ...              ...
188    Venezuela            333              100
189      Vietnam            111                2
190        Yemen              6                0
191       Zambia             32               19
192     Zimbabwe             64               18

[193 rows x 3 columns]

In [52]:
pd.read_csv(r'F:\DataSpell\Pandas_training\from_youtube_video\data\pandas-videos-master\drinks2.csv')

     wine_servings  total_litres_of_pure_alcohol      continent
0                0                           0.0           Asia
1               54                           4.9         Europe
2               14                           0.7         Africa
3              312                          12.4         Europe
4               45                           5.9         Africa
..             ...                           ...            ...
188              3                           7.7  South America
189              1                           2.0           Asia
190              0                           0.1           Asia
191              4                           2.5         Africa
192              4                           4.7         Africa

[193 rows x 3 columns]

In [ ]:
drinks_path = r'F:\DataSpell\Pandas_training\from_youtube_video\data\pandas-videos-master\drinks*.csv'

In [54]:
drinks_files = sorted(glob(drinks_path))
drinks_files

['F:\\DataSpell\\Pandas_training\\from_youtube_video\\data\\pandas-videos-master\\drinks.csv']

In [56]:
pd.concat((pd.read_csv(file) for file in drinks_files), axis='columns')

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,South America
189,Vietnam,111,2,1,2.0,Asia
190,Yemen,6,0,0,0.1,Asia
191,Zambia,32,19,4,2.5,Africa
192,Zimbabwe,64,18,4,4.7,Africa

# 11. Create a DataFrame from the clipboard

In [59]:
df = pd.read_clipboard()
df

Empty DataFrame
Columns: [The, pd.read_clipboard(), function, is, a, part, of, the, pandas, library, in, Python,, which, is.1, widely, used, for, data, manipulation, and, analysis., This, particular, function.1, reads, the.1, contents, of.1, your, clipboard, and.1, attempts, to, convert, it, into, a.1, pandas.1, DataFrame., Essentially,, it's, a.2, quick, and.2, convenient, way, to.1, import, tabular, data.1, (like, a.3, table, copied, from, a.4, web, page, or, a.5, spreadsheet), directly, into.1, a.6, DataFrame, without, needing, to.2, save, it.1, to.3, a.7, file, first.]
Index: []

[0 rows x 74 columns]

# 12. Split a DataFrame into two random subsets

In [60]:
movies_path = r'F:\DataSpell\Pandas_training\from_youtube_video\data\pandas-videos-master\imdb_1000.csv'

In [61]:
movies = pd.read_csv(movies_path)

In [63]:
movies_1 = movies.sample(frac=0.75, random_state=123)
movies_1

,star_rating,title,content_rating,genre,duration,actors_list
905,7.5,Dracula,R,Horror,128,"[u'Gary Oldman', u'Winona Ryder', u'Anthony Ho..."
882,7.5,Mulan,G,Animation,88,"[u'Ming-Na Wen', u'Eddie Murphy', u'BD Wong']"
368,8.0,Planet of the Apes,G,Adventure,112,"[u'Charlton Heston', u'Roddy McDowall', u'Kim ..."
853,7.5,L'illusionniste,PG,Animation,80,"[u'Jean-Claude Donda', u'Eilidh Rankin', u'Dun..."
85,8.4,Lawrence of Arabia,PG,Adventure,216,"[u""Peter O'Toole"", u'Alec Guinness', u'Anthony..."
...,...,...,...,...,...,...
891,7.5,Harry Potter and the Half-Blood Prince,PG,Adventure,153,"[u'Daniel Radcliffe', u'Emma Watson', u'Rupert..."
10,8.8,The Lord of the Rings: The Fellowship of the Ring,PG-13,Adventure,178,"[u'Elijah Wood', u'Ian McKellen', u'Orlando Bl..."
959,7.4,Deconstructing Harry,R,Comedy,96,"[u'Woody Allen', u'Judy Davis', u'Julia Louis-..."
540,7.8,The Color Purple,PG-13,Drama,154,"[u'Danny Glover', u'Whoopi Goldberg', u'Oprah ..."
251,8.1,The Man Who Shot Liberty Valance,APPROVED,Drama,123,"[u'James Stewart', u'John Wayne', u'Vera Miles']"

In [65]:
movies_2 = movies.drop(movies_1.index)
movies_2

,star_rating,title,content_rating,genre,duration,actors_list
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
8,8.9,Schindler's List,R,Biography,195,"[u'Liam Neeson', u'Ralph Fiennes', u'Ben Kings..."
14,8.8,The Lord of the Rings: The Two Towers,PG-13,Adventure,179,"[u'Elijah Wood', u'Ian McKellen', u'Viggo Mort..."
16,8.7,One Flew Over the Cuckoo's Nest,R,Drama,133,"[u'Jack Nicholson', u'Louise Fletcher', u'Mich..."
...,...,...,...,...,...,...
961,7.4,Capote,R,Biography,114,"[u'Philip Seymour Hoffman', u'Clifton Collins ..."
970,7.4,Wonder Boys,R,Drama,107,"[u'Michael Douglas', u'Tobey Maguire', u'Franc..."
972,7.4,Blue Valentine,NC-17,Drama,112,"[u'Ryan Gosling', u'Michelle Williams', u'John..."
975,7.4,Back to the Future Part III,PG,Adventure,118,"[u'Michael J. Fox', u'Christopher Lloyd', u'Ma..."
977,7.4,Poltergeist,PG,Horror,114,"[u'JoBeth Williams', u""Heather O'Rourke"", u'Cr..."

# 13. Filter a DataFrame by multiple categories

In [67]:
movies.genre.unique()

array(['Crime', 'Action', 'Drama', 'Western', 'Adventure', 'Biography',
       'Comedy', 'Animation', 'Mystery', 'Horror', 'Film-Noir', 'Sci-Fi',
       'History', 'Thriller', 'Family', 'Fantasy'], dtype=object)

In [68]:
movies[movies.genre.isin(['Crime', 'Drama', 'Action'])]

,star_rating,title,content_rating,genre,duration,actors_list
0,9.3,The Shawshank Redemption,R,Crime,142,"[u'Tim Robbins', u'Morgan Freeman', u'Bob Gunt..."
1,9.2,The Godfather,R,Crime,175,"[u'Marlon Brando', u'Al Pacino', u'James Caan']"
2,9.1,The Godfather: Part II,R,Crime,200,"[u'Al Pacino', u'Robert De Niro', u'Robert Duv..."
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
4,8.9,Pulp Fiction,R,Crime,154,"[u'John Travolta', u'Uma Thurman', u'Samuel L...."
...,...,...,...,...,...,...
970,7.4,Wonder Boys,R,Drama,107,"[u'Michael Douglas', u'Tobey Maguire', u'Franc..."
972,7.4,Blue Valentine,NC-17,Drama,112,"[u'Ryan Gosling', u'Michelle Williams', u'John..."
973,7.4,The Cider House Rules,PG-13,Drama,126,"[u'Tobey Maguire', u'Charlize Theron', u'Micha..."
976,7.4,Master and Commander: The Far Side of the World,PG-13,Action,138,"[u'Russell Crowe', u'Paul Bettany', u'Billy Bo..."
978,7.4,Wall Street,R,Crime,126,"[u'Charlie Sheen', u'Michael Douglas', u'Tamar..."

In [69]:
movies[~movies.genre.isin(['Crime', 'Drama', 'Action'])]

,star_rating,title,content_rating,genre,duration,actors_list
6,8.9,"The Good, the Bad and the Ugly",NOT RATED,Western,161,"[u'Clint Eastwood', u'Eli Wallach', u'Lee Van ..."
7,8.9,The Lord of the Rings: The Return of the King,PG-13,Adventure,201,"[u'Elijah Wood', u'Viggo Mortensen', u'Ian McK..."
8,8.9,Schindler's List,R,Biography,195,"[u'Liam Neeson', u'Ralph Fiennes', u'Ben Kings..."
10,8.8,The Lord of the Rings: The Fellowship of the Ring,PG-13,Adventure,178,"[u'Elijah Wood', u'Ian McKellen', u'Orlando Bl..."
14,8.8,The Lord of the Rings: The Two Towers,PG-13,Adventure,179,"[u'Elijah Wood', u'Ian McKellen', u'Viggo Mort..."
...,...,...,...,...,...,...
966,7.4,The Simpsons Movie,PG-13,Animation,87,"[u'Dan Castellaneta', u'Julie Kavner', u'Nancy..."
971,7.4,Death at a Funeral,R,Comedy,90,"[u'Matthew Macfadyen', u'Peter Dinklage', u'Ew..."
974,7.4,Tootsie,PG,Comedy,116,"[u'Dustin Hoffman', u'Jessica Lange', u'Teri G..."
975,7.4,Back to the Future Part III,PG,Adventure,118,"[u'Michael J. Fox', u'Christopher Lloyd', u'Ma..."
977,7.4,Poltergeist,PG,Horror,114,"[u'JoBeth Williams', u""Heather O'Rourke"", u'Cr..."

# 14. Filter a DataFrame by largest categories

In [71]:
counts = movies.genre.value_counts()
counts

genre
Drama        278
Comedy       156
Action       136
Crime        124
Biography     77
Adventure     75
Animation     62
Horror        29
Mystery       16
Western        9
Sci-Fi         5
Thriller       5
Film-Noir      3
Family         2
History        1
Fantasy        1
Name: count, dtype: int64

In [73]:
counts.nlargest(3).index

Index(['Drama', 'Comedy', 'Action'], dtype='object', name='genre')

In [75]:
movies[movies.genre.isin(counts.nlargest(3).index)]

,star_rating,title,content_rating,genre,duration,actors_list
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
5,8.9,12 Angry Men,NOT RATED,Drama,96,"[u'Henry Fonda', u'Lee J. Cobb', u'Martin Bals..."
9,8.9,Fight Club,R,Drama,139,"[u'Brad Pitt', u'Edward Norton', u'Helena Bonh..."
11,8.8,Inception,PG-13,Action,148,"[u'Leonardo DiCaprio', u'Joseph Gordon-Levitt'..."
12,8.8,Star Wars: Episode V - The Empire Strikes Back,PG,Action,124,"[u'Mark Hamill', u'Harrison Ford', u'Carrie Fi..."
...,...,...,...,...,...,...
971,7.4,Death at a Funeral,R,Comedy,90,"[u'Matthew Macfadyen', u'Peter Dinklage', u'Ew..."
972,7.4,Blue Valentine,NC-17,Drama,112,"[u'Ryan Gosling', u'Michelle Williams', u'John..."
973,7.4,The Cider House Rules,PG-13,Drama,126,"[u'Tobey Maguire', u'Charlize Theron', u'Micha..."
974,7.4,Tootsie,PG,Comedy,116,"[u'Dustin Hoffman', u'Jessica Lange', u'Teri G..."
976,7.4,Master and Commander: The Far Side of the World,PG-13,Action,138,"[u'Russell Crowe', u'Paul Bettany', u'Billy Bo..."

# 15. Handle missing values

In [76]:
ufo_path = r'F:\DataSpell\Pandas_training\from_youtube_video\data\pandas-videos-master\ufo.csv'

In [77]:
ufo = pd.read_csv(ufo_path)

In [84]:
ufo.isna().sum()

City                  26
Colors Reported    15359
Shape Reported      2644
State                  0
Time                   0
dtype: int64

In [85]:
ufo.isna().mean()

City               0.001425
Colors Reported    0.842004
Shape Reported     0.144948
State              0.000000
Time               0.000000
dtype: float64

In [86]:
ufo.dropna(thresh=len(ufo)*0.9, axis='columns').head()

                   City State             Time
0                Ithaca    NY   6/1/1930 22:00
1           Willingboro    NJ  6/30/1930 20:00
2               Holyoke    CO  2/15/1931 14:00
3               Abilene    KS   6/1/1931 13:00
4  New York Worlds Fair    NY  4/18/1933 19:00

# 16. Split a string into multiple columns

In [87]:
df = pd.DataFrame({'name': ['John Arthur Doe', 'Jane Ann Smith'],
                   'location': ['Los Angeles, CA', 'Washington, DC']})
df

              name         location
0  John Arthur Doe  Los Angeles, CA
1   Jane Ann Smith   Washington, DC

In [88]:
df.name.str.split(' ', expand=True)

      0       1      2
0  John  Arthur    Doe
1  Jane     Ann  Smith

In [90]:
df[['first', 'middle', 'last']] = df.name.str.split(' ', expand=True)
df

              name         location first  middle   last
0  John Arthur Doe  Los Angeles, CA  John  Arthur    Doe
1   Jane Ann Smith   Washington, DC  Jane     Ann  Smith

# 17. Expand a Series of lists into a DataFrame

In [91]:
df = pd.DataFrame({'col_one': ['a', 'b', 'c'],
                   'col_two': [[10, 40], [20, 50, 30], [30]]})
df

  col_one       col_two
0       a      [10, 40]
1       b  [20, 50, 30]
2       c          [30]

In [92]:
df_new = df.col_two.apply(pd.Series)
df_new

      0     1     2
0  10.0  40.0   NaN
1  20.0  50.0  30.0
2  30.0   NaN   NaN

In [93]:
pd.concat([df, df_new], axis='columns')

  col_one       col_two     0     1     2
0       a      [10, 40]  10.0  40.0   NaN
1       b  [20, 50, 30]  20.0  50.0  30.0
2       c          [30]  30.0   NaN   NaN

# 18. Aggregate by multiple functions

In [94]:
orders_path = r'F:\DataSpell\Pandas_training\from_youtube_video\data\pandas-videos-master\chipotle.tsv'

In [101]:
orders = pd.read_csv(orders_path, sep='\t')
orders['item_price'] = orders.item_price.str.replace('$', '').astype(float)
orders

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98
...,...,...,...,...,...
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",8.75

In [102]:
orders.groupby('order_id')['item_price'].agg(['sum', 'mean']).head()

            sum    mean
order_id
1         11.56   2.890
2         16.98  16.980
3         12.67   6.335
4         21.00  10.500
5         13.70   6.850

# 19. Combine the output of an aggregation with a DataFrame

In [104]:
len(orders.groupby('order_id')['item_price'].agg(['sum', 'mean']))

1834

In [106]:
orders.groupby('order_id')['item_price'].transform('sum')

0       11.56
1       11.56
2       11.56
3       11.56
4       16.98
        ...
4617    23.50
4618    23.50
4619    28.75
4620    28.75
4621    28.75
Name: item_price, Length: 4622, dtype: float64

# 20. Select a slice of rows and columns

In [107]:
titanic_path = r'F:\DataSpell\Pandas_training\from_youtube_video\data\pandas-videos-master\titanic_train.csv'

In [108]:
titanic = pd.read_csv(titanic_path)

In [109]:
titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [112]:
titanic.describe().loc['min':'max', 'Pclass':'Parch']

     Pclass     Age  SibSp  Parch
min     1.0   0.420    0.0    0.0
25%     2.0  20.125    0.0    0.0
50%     3.0  28.000    0.0    0.0
75%     3.0  38.000    1.0    0.0
max     3.0  80.000    8.0    6.0

# 21. Reshape a MultiIndexed Series

In [114]:
titanic.groupby(['Sex', 'Pclass'])['Survived'].mean().unstack()

Pclass         1         2         3
Sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

# 22. Create a pivot table

In [117]:
titanic.pivot_table(index='Sex', columns='Pclass', values='Survived', aggfunc='mean', margins=True)

Pclass         1         2         3       All
Sex
female  0.968085  0.921053  0.500000  0.742038
male    0.368852  0.157407  0.135447  0.188908
All     0.629630  0.472826  0.242363  0.383838

In [118]:
titanic.pivot_table(index='Sex', columns='Pclass', values='Survived', aggfunc='count', margins=True)

Pclass    1    2    3  All
Sex
female   94   76  144  314
male    122  108  347  577
All     216  184  491  891

# 23. Convert continuous data into categorical data

In [120]:
titanic['Age'].head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: Age, dtype: float64

In [121]:
pd.cut(titanic['Age'], bins=[0, 18, 25, 99], labels=['child', 'young adult', 'adult']).head()

0    young adult
1          adult
2          adult
3          adult
4          adult
Name: Age, dtype: category
Categories (3, object): ['child' < 'young adult' < 'adult']

In [122]:
pd.qcut(titanic['Age'], q=3, labels=['young', 'middle', 'old']).head()

0     young
1       old
2    middle
3       old
4       old
Name: Age, dtype: category
Categories (3, object): ['young' < 'middle' < 'old']

# 24. Change display options

In [123]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [124]:
pd.set_option('display.float_format', '{:.2f}'.format)

In [126]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.00,1,0,A/5 21171,7.25,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.00,1,0,PC 17599,71.28,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.00,0,0,STON/O2. 3101282,7.92,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.00,1,0,113803,53.10,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.00,0,0,373450,8.05,NaN,S

In [127]:
pd.reset_option('display.float_format')

# 25. Style a DataFrame

In [128]:
stocks_path = r'F:\DataSpell\Pandas_training\from_youtube_video\data\pandas-videos-master\stocks.csv'

In [129]:
stocks = pd.read_csv(stocks_path)
stocks

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT
3  2016-10-04  113.00  29736800   AAPL
4  2016-10-04   57.24  20085900   MSFT
5  2016-10-04   31.35  18460400   CSCO
6  2016-10-05   57.64  16726400   MSFT
7  2016-10-05   31.59  11808600   CSCO
8  2016-10-05  113.05  21453100   AAPL

In [130]:
format_dict = {'Date': '{:%m/%d/%y}', 'Close': '${:.2f}', 'Volume': '{:,}'}
format_dict

{'Date': '{:%m/%d/%y}', 'Close': '${:.2f}', 'Volume': '{:,}'}

In [133]:
# stocks.style.format(format_dict)

# 26. Profile a DataFrame

In [145]:
import ydata_profiling

In [148]:
profile = ydata_profiling.ProfileReport(titanic, correlations={"auto": {"calculate": False}}, missing_diagrams={"Heatmap": False})
profile.to_file("titanic.html")

Summarize dataset:   0%|          | 0/5 [00:00<?, ?it/s]

F:\DataSpell\Pandas_training\venv\Lib\site-packages\seaborn\matrix.py:260: FutureWarning: Format strings passed to MaskedConstant are ignored, but in future may error or produce different behavior
  annotation = ("{:" + self.fmt + "}").format(val)
F:\DataSpell\Pandas_training\venv\Lib\site-packages\ydata_profiling\model\missing.py:78: UserWarning: There was an attempt to generate the Heatmap missing values diagrams, but this failed.
To hide this warning, disable the calculation
(using `df.profile_report(missing_diagrams={"Heatmap": False}`)
If this is problematic for your use case, please report this as an issue:
https://github.com/ydataai/ydata-profiling/issues
(include the error message: 'could not convert string to float: '--'')
  warnings.warn(

Generate report structure:   0%|          | 0/1 [00:00<?, ?it/s]

Render HTML:   0%|          | 0/1 [00:00<?, ?it/s]

Export report to file:   0%|          | 0/1 [00:00<?, ?it/s]

Requirement already satisfied: pydantic-settings in f:\dataspell\pandas_training\venv\lib\site-packages (2.2.1)
Requirement already satisfied: pydantic>=2.3.0 in f:\dataspell\pandas_training\venv\lib\site-packages (from pydantic-settings) (2.6.4)
Requirement already satisfied: python-dotenv>=0.21.0 in f:\dataspell\pandas_training\venv\lib\site-packages (from pydantic-settings) (1.0.1)
Requirement already satisfied: annotated-types>=0.4.0 in f:\dataspell\pandas_training\venv\lib\site-packages (from pydantic>=2.3.0->pydantic-settings) (0.6.0)
Requirement already satisfied: pydantic-core==2.16.3 in f:\dataspell\pandas_training\venv\lib\site-packages (from pydantic>=2.3.0->pydantic-settings) (2.16.3)
Requirement already satisfied: typing-extensions>=4.6.1 in f:\dataspell\pandas_training\venv\lib\site-packages (from pydantic>=2.3.0->pydantic-settings) (4.10.0)
Note: you may need to restart the kernel to use updated packages.